{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "batch_input_shape": [null, 64, 64, 3], "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00a6\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "bias": true, "name": "convolution2d_1", "b_constraint": null, "activation": "relu", "nb_filter": 24, "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "bias": true, "name": "convolution2d_2", "b_constraint": null, "activation": "relu", "nb_filter": 36, "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "bias": true, "name": "convolution2d_3", "b_constraint": null, "activation": "relu", "nb_filter": 48, "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "name": "convolution2d_4", "b_constraint": null, "activation": "relu", "nb_filter": 64, "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "name": "convolution2d_5", "b_constraint": null, "activation": "relu", "nb_filter": 64, "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "input_dim": 64, "trainable": true, "output_dim": 100, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_2", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "input_dim": 100, "trainable": true, "output_dim": 50, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_3", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "input_dim": 50, "trainable": true, "output_dim": 10, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_4", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "input_dim": 10, "trainable": true, "output_dim": 1, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}], "keras_version": "1.2.1"}